app/controllers/posts_controller.rb

  def index
    @user_id = params[:user_id] || nil
    if @user_id.nil?
      @title = "All Posts"
      @posts = Post.active.paginate(:page => params[:page])
    else
      @user = User.find(@user_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."active" = 't' ORDER BY posts.created_at DESC LIMIT 30 OFFSET 0
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def new
    @title = "Create Post"
    @post = Post.new
    @states = State.all
    @cities = City.all
    @goods = Category.find_all_by_category_type("Goods")
---
SELECT "states".* FROM "states" ORDER BY states.name ASC
SELECT "cities".* FROM "cities" ORDER BY cities.name ASC
SELECT "categories".* FROM "categories" WHERE "categories"."category_type" = 'Goods'

  def create
    if signed_in?
      @post = current_user.posts.build(params[:post])
      if @post.save
        flash[:success] = "Post created!"
        redirect_to post_path(@post)
      else
        @states = State.all
        @cities = City.all
        @goods = Category.find_all_by_category_type("Goods")
---
INSERT INTO "posts" ("title", "description", "trade_for", "city_id", "user_id", "created_at", "updated_at", "active", "email", "activation_hash", "activated_at") VALUES ('a', 'a', 'a', 3, NULL, '2011-06-12 03:28:46.951128', '2011-06-12 03:28:46.951128', 'f', 'hardik1447@yahoo.co.in', '76a7a690101c8b8e43cb5084faec4740491bbd6da8ab116c5999a51ce778df79', NULL)
SELECT "states".* FROM "states" ORDER BY states.name ASC
SELECT "cities".* FROM "cities" ORDER BY cities.name ASC
SELECT "categories".* FROM "categories" WHERE "categories"."category_type" = 'Goods'

  def activate
    @post = Post.find_by_id(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 0 ORDER BY posts.created_at DESC LIMIT 1

 def search
    @inputs = params[:post]
    if @inputs.nil?
      @title = "Post Search"
      @query = nil
      @posts = Post.search(@query)
---
SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%at%' OR lower(description) OR lower(trade_for) or lower(city_id) or lower(catagory_ids) or lower(state_id) LIKE '%at%') ORDER BY posts.created_at DESC